apps/nfe/wsdl/nfeconsultaprotocolo.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="NFeConsultaProtocoloService"
  targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeConsultaProtocolo"
  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeConsultaProtocolo"
  xmlns:nfe="http://www.portalfiscal.inf.br/nfe"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
>

  <wsdl:types>
    <xsd:schema targetNamespace="http://www.portalfiscal.inf.br/nfe">
      <xsd:import namespace="http://www.portalfiscal.inf.br/nfe"
        schemaLocation="../xsd/consSitNFe_v4.00.xsd" />
      <xsd:import namespace="http://www.portalfiscal.inf.br/nfe"
        schemaLocation="../xsd/retConsSitNFe_v4.00.xsd" />
    </xsd:schema>
  </wsdl:types>

  <wsdl:message name="nfeConsultaNFRequest">
    <wsdl:part name="nfeDadosMsg" element="nfe:consSitNFe" />
  </wsdl:message>
  <wsdl:message name="nfeConsultaNFResponse">
    <wsdl:part name="nfeResultMsg" element="nfe:retConsSitNFe" />
  </wsdl:message>

  <wsdl:portType name="NFeConsultaProtocoloPortType">
    <wsdl:operation name="nfeConsultaNF">
      <wsdl:input message="tns:nfeConsultaNFRequest" />
      <wsdl:output message="tns:nfeConsultaNFResponse" />
    </wsdl:operation>
  </wsdl:portType>

  <wsdl:binding name="NFeConsultaProtocoloSoapBinding" type="tns:NFeConsultaProtocoloPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="nfeConsultaNF">
      <soap:operation
        soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeConsultaProtocolo/nfeConsultaNF" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>

  <wsdl:service name="NFeConsultaProtocoloService">
    <wsdl:port name="NFeConsultaProtocoloPort" binding="tns:NFeConsultaProtocoloSoapBinding">
      <soap:address
        location="https://localhost:3000/ws/nfeconsultaprotocolo" />
    </wsdl:port>
  </wsdl:service>

</wsdl:definitions>
